# ==============================================================================
# VS Code Extensions
# 
# Install all: cat extensions.txt | xargs -L 1 code --install-extension
# Or run: ./scripts/setup-vscode.sh
# ==============================================================================

# ------------------------------------------------------------------------------
# AI / Claude
# ------------------------------------------------------------------------------
anthropic.claude-code

# ------------------------------------------------------------------------------
# Cloudflare
# ------------------------------------------------------------------------------
cloudflare.cloudflare-workers

# ------------------------------------------------------------------------------
# Theme & Icons
# ------------------------------------------------------------------------------
zhuangtongfa.material-theme
pkief.material-icon-theme

# ------------------------------------------------------------------------------
# Git
# ------------------------------------------------------------------------------
eamodio.gitlens
mhutchie.git-graph

# ------------------------------------------------------------------------------
# JavaScript / TypeScript
# ------------------------------------------------------------------------------
esbenp.prettier-vscode
dbaeumer.vscode-eslint
bradlc.vscode-tailwindcss

# ------------------------------------------------------------------------------
# Python
# ------------------------------------------------------------------------------
ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
ms-python.isort
ms-toolsai.jupyter

# ------------------------------------------------------------------------------
# Editor Enhancement
# ------------------------------------------------------------------------------
usernamehw.errorlens
streetsidesoftware.code-spell-checker
christian-kohler.path-intellisense
formulahendry.auto-rename-tag
formulahendry.auto-close-tag
naumovs.color-highlight

# ------------------------------------------------------------------------------
# Markdown
# ------------------------------------------------------------------------------
yzhang.markdown-all-in-one
bierner.markdown-preview-github-styles

# ------------------------------------------------------------------------------
# Remote / Dev Containers (optional)
# ------------------------------------------------------------------------------
# ms-vscode-remote.remote-ssh
# ms-vscode-remote.remote-containers

# ------------------------------------------------------------------------------
# Utilities
# ------------------------------------------------------------------------------
editorconfig.editorconfig
mikestead.dotenv
mechatroner.rainbow-csv
redhat.vscode-yaml
